---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.ExternalApplicationException
source: html/2ddc75b9-c531-4d09-a579-a387e29fee7f.htm
---
# ExternalApplicationException Methods

Retrieves data needed to serialize the target object.